# parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [ 46,13,  44,19,  69,17 ]  # P3/8         UAV-ROD
  - [ 77,20,  63,26,  88,23 ]  # P4/16
  - [ 95,24,  102,27,  121,33 ]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]               # [c=channels,module,kernlsize,strides]
  [[-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2           [c=3,64*0.5=32,3]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4    
   [-1, 3, C3, [128]],          #2                     
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8            
   [-1, 6, C3, [256]],          #4
   [-1, 3, CoordAtt, [256]] ,   #5                   
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16       
   [-1, 9, C3, [512]],          #7
   [-1, 3, CoordAtt, [512]],                     
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 3, C3, [1024]],  # 10
   [-1, 3, CoordAtt, [1024]], #11
   [-1, 1, SPPF, [1024, 5]], #12
   [-1, 3, C3STR, [1024]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  #13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)


   [-1, 1, Conv, [256, 3, 2]], 
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 23 (P4/16-medium)       [256, 256, 1, False]  
   #[-1, 3, CBAM, [512]],   #26
 

   [-1, 1, Conv, [512, 3, 2]],    #24                       #[256, 256, 3, 2] 
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 26 (P5/32-large)       [512, 512, 1, False]

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
