# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3
#  - [10,13, 16,30, 33,23]  # P3/8            COCO
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

#  - [ 46,13,  44,19,  69,17 ]  # P3/8         UAV-ROD
#  - [ 77,20,  63,26,  88,23 ]  # P4/16
#  - [ 95,24,  102,27,  121,33 ]  # P5/32

  - [ 20,20,  30,14,  36,17]      # UCAS-AOD
  - [ 30,27,  44,21,  38,36]
  - [ 49,46,  62,57,  83,76]


# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, BiFPN_Add2, [256, 256]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, BiFPN_Add2, [128, 128]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ [-1, 2], 1, BiFPN_Add2, [64, 64]],  # cat backbone P2
   [ -1, 3, C3, [ 128, False ] ],  # 21 (P2/4-xsmall)

   [ -1, 1, Conv, [ 256, 3, 2 ] ],
   [[-1, 17, 4], 1, BiFPN_Add3, [128, 128]],  # cat head P3
   [ -1, 3, C3, [ 256, False ] ],  # 24 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13, 6], 1, BiFPN_Add3, [256, 256]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, BiFPN_Add2, [256, 256]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
